# 1. Intro

## Using sql in the notebook

In [9]:
%load_ext sql

%sql sqlite:///dataset_university.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @dataset_university.db'

In [10]:
%sql SELECT * FROM Faculty

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song', 100, 'AS_PROF', 'IME', None, 'mssong@postech.ac.kr', '2016-03-01'),
 ('fac002', 'Dong', 'Choi', 150, 'AS_PROF', 'IME', 'fac001', 'dgchoi@postech.ac.kr', '2016-03-01'),
 ('fac004', 'Myung', 'Ko', 250, 'PROF', 'IME', None, 'youngko@postech.ac.kr', '2012-03-01'),
 ('fac003', 'Min', 'Che', 200, 'PROF', 'IME', 'fac004', 'mchae@postech.ac.kr', '2019-05-01')]

In [11]:
%%sql# 여러줄에서 sql문 구성 가능

UsageError: Cell magic `%%sql#` not found.

In [12]:
%%sql 
SELECT FacFirstName, FacLastName, FacSalary*1.5
AS IncreasedSalary, FacHireDate
FROM Faculty WHERE FacHireDate < '2016-03-02';

 * sqlite:///dataset_university.db
Done.

[('Min', 'Song', 150.0, '2016-03-01'),
 ('Dong', 'Choi', 225.0, '2016-03-01'),
 ('Myung', 'Ko', 375.0, '2012-03-01')]

# 2. SQL_Select

## First SELECT Examples

In [15]:
%sql SELECT * FROM Faculty;

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song', 100, 'AS_PROF', 'IME', None, 'mssong@postech.ac.kr', '2016-03-01'),
 ('fac002', 'Dong', 'Choi', 150, 'AS_PROF', 'IME', 'fac001', 'dgchoi@postech.ac.kr', '2016-03-01'),
 ('fac004', 'Myung', 'Ko', 250, 'PROF', 'IME', None, 'youngko@postech.ac.kr', '2012-03-01'),
 ('fac003', 'Min', 'Che', 200, 'PROF', 'IME', 'fac004', 'mchae@postech.ac.kr', '2019-05-01')]

In [16]:
%%sql
SELECT *
FROM Faculty
WHERE FacSSN = 'fac001'

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song', 100, 'AS_PROF', 'IME', None, 'mssong@postech.ac.kr', '2016-03-01')]

In [19]:
%%sql
SELECT FacFirstName, FacLastName, FacSalary
FROM Faculty
WHERE FacSalary > 200 AND FacRank = 'PROF';

 * sqlite:///dataset_university.db
Done.

[('Myung', 'Ko', 250)]

In [22]:
%%sql
SELECT FacFirstName, FacLastName,
FacSalary * 1.5 AS IncreasedSalary,
FacHireDate
FROM Faculty
WHERE FacHireDate < '2016-03-02'

 * sqlite:///dataset_university.db
Done.

[('Min', 'Song', 150.0, '2016-03-01'),
 ('Dong', 'Choi', 225.0, '2016-03-01'),
 ('Myung', 'Ko', 375.0, '2012-03-01')]

## Inexact Matching

In [23]:
%%sql
SELECT *
FROM Offering
WHERE CourseNo LIKE 'im%'

 * sqlite:///dataset_university.db
Done.

[('offer01', 'FALL', 2020, 'Tue/Thur', 'imen001', 'fac001'),
 ('offer02', 'SPRING', 2019, 'Tue/Thur', 'imen003', 'fac002'),
 ('offer03', 'FALL', 2020, 'Tue/Thur', 'imen002', None),
 ('offer04', 'FALL', 2020, 'Mon/Wed', 'imen002', 'fac001'),
 ('offer05', 'FALL', 2020, 'Tue/Thur', 'imen003', 'fac004'),
 ('offer06', 'FALL', 2020, 'Tue/Thur', 'imen003', 'fac003')]

In [24]:
%%sql
SELECT *
FROM Faculty
WHERE FacLastName LIKE '_o%'

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song', 100, 'AS_PROF', 'IME', None, 'mssong@postech.ac.kr', '2016-03-01'),
 ('fac004', 'Myung', 'Ko', 250, 'PROF', 'IME', None, 'youngko@postech.ac.kr', '2012-03-01')]

## Using Dates

In [25]:
%%sql
SELECT FacFirstName, FacLastName, FacHireDate
FROM Faculty
WHERE FacHireDate
BETWEEN '2016-03-01' and '2020-03-01'

 * sqlite:///dataset_university.db
Done.

[('Min', 'Song', '2016-03-01'),
 ('Dong', 'Choi', '2016-03-01'),
 ('Min', 'Che', '2019-05-01')]

## Other Single Table Examples

In [ ]:
# Testing for null values

In [29]:
%%sql
SELECT OfferNo, CourseNo, FacSSN
FROM Offering
WHERE FacSSN IS NULL AND OffTerm = 'FALL'
AND OffYear = 2020;

 * sqlite:///dataset_university.db
Done.

[('offer03', 'imen002', None)]

In [30]:
# Mixing AND and OR

In [32]:
%%sql
SELECT OfferNo, CourseNo, FacSSN
FROM Offering
WHERE (OffTerm = 'FALL' AND OffYear = 2020)
OR (OffTerm = 'SPRING' AND OffYear = 2019)

 * sqlite:///dataset_university.db
Done.

[('offer01', 'imen001', 'fac001'),
 ('offer02', 'imen003', 'fac002'),
 ('offer03', 'imen002', None),
 ('offer04', 'imen002', 'fac001'),
 ('offer05', 'imen003', 'fac004'),
 ('offer06', 'imen003', 'fac003')]

## Cross Product Style

In [33]:
%%sql
SELECT OfferNo, CourseNo, FacFirstName, FacLastName
FROM Offering, Faculty
WHERE OffTerm = 'FALL' AND OffYear = 2020
AND FacRank = 'AS_PROF' AND CourseNo LIKE 'im%'
AND Faculty.FacSSN = Offering.FacSSN

 * sqlite:///dataset_university.db
Done.

[('offer01', 'imen001', 'Min', 'Song'), ('offer04', 'imen002', 'Min', 'Song')]

## Join Operator Style

In [34]:
%%sql
SELECT OfferNo, CourseNo, FacFirstName, FacLastName
FROM Offering INNER JOIN Faculty
On Faculty.FacSSN = Offering.FacSSN
WHERE OffTerm = 'FALL' AND OffYear = 2020
AND FacRank = 'AS_PROF'
AND CourseNo LIKE 'IM%'

 * sqlite:///dataset_university.db
Done.

[('offer01', 'imen001', 'Min', 'Song'), ('offer04', 'imen002', 'Min', 'Song')]

# GroupBy

## GROUP BY Examples

In [35]:
%%sql
SELECT FacRank, AVG(FacSalary) As AvgSalary
FROM Faculty
GROUP BY FacRank

 * sqlite:///dataset_university.db
Done.

[('AS_PROF', 125.0), ('PROF', 225.0)]

In [37]:
%%sql
SELECT StdMajor, AVG(stdGPA) AS AvgGpa
FROM Student
WHERE StdClass IN ('JR', 'SR')
GROUP BY StdMajor
HAVING AVG(StdGPA) > 4.1

 * sqlite:///dataset_university.db
Done.

[('OR', 4.15)]

## Summarization and Joins

In [48]:
%%sql
SELECT Offering.OfferNo,
COUNT (*) AS NumStudents
FROM Enrollment, Offering
WHERE Offering.OfferNo = Enrollment.OfferNo
AND OffYear = 2020
AND OffTerm = 'FALL'
GROUP BY Offering.OfferNo

 * sqlite:///dataset_university.db
Done.

[('offer01', 3),
 ('offer03', 5),
 ('offer04', 5),
 ('offer05', 3),
 ('offer06', 4)]

# SQL_Advanced

## Joining Three Tables

In [49]:
%%sql
SELECT OfferNo, Offering.CourseNo, OffDays
FROM Faculty, Course, Offering
WHERE Faculty.FacSSN = Offering.FacSSN
AND Offering.CourseNo = Course.CourseNo
AND OffYear = 2020 AND OffTerm = 'FALL'
AND FacLastName = 'Song'

 * sqlite:///dataset_university.db
Done.

[('offer01', 'imen001', 'Tue/Thur'), ('offer04', 'imen002', 'Mon/Wed')]

## Joining Four Tables

In [50]:
%%sql
SELECT Offering.OfferNo, Offering.CourseNo,
OffDays, FacFirstName, FacLastName
FROM Faculty, Offering, Enrollment, Student
WHERE Offering.OfferNo = Enrollment.OfferNo
AND Student.StdSSN = Enrollment.StdSSN
AND Faculty.FacSSN = Offering.FacSSN
AND OffYear = 2020 AND OffTerm = 'FALL'
AND StdFirstName = 'Jung'
AND StdLastName = 'Lim'

 * sqlite:///dataset_university.db
Done.

[('offer01', 'imen001', 'Tue/Thur', 'Min', 'Song'),
 ('offer04', 'imen002', 'Mon/Wed', 'Min', 'Song'),
 ('offer05', 'imen003', 'Tue/Thur', 'Myung', 'Ko'),
 ('offer06', 'imen003', 'Tue/Thur', 'Min', 'Che')]

## Self-Join Example

In [51]:
%%sql
SELECT Subr.FacSSN, Subr.FacLastName, Subr.FacSalary, Supr.FacSSN, Supr.FacLastName, Supr.FacSalary
FROM Faculty Subr, Faculty Supr
WHERE Subr.FacSupervisor = Supr.FacSSN
AND Subr.FacSalary > Supr.FacSalary

 * sqlite:///dataset_university.db
Done.

[('fac002', 'Choi', 150, 'fac001', 'Song', 100)]

## Multiple Joins Between Tables

In [58]:
%%sql
SELECT FacFirstName, FacLastName, O1.CourseNo 
FROM Faculty, Offering O1, Offering O2
WHERE Faculty.FacSSN = O1.FacSSN 
AND Faculty.FacSupervisor = O2.FacSSN 
AND O1.OffYear = 2020 AND O2.OffYear = 2020
AND O1.CourseNo = O2.CourseNo

 * sqlite:///dataset_university.db
Done.

[('Min', 'Che', 'imen003')]

## Multiple Column Grouping

In [61]:
%%sql
SELECT CourseNo, Enrollment.OfferNo, Count (*) As NumStudents
FROM Offering, Enrollment
WHERE Offering.OfferNo = Enrollment.OfferNo
AND OffYear = 2020 AND OffTerm = 'FALL'
GROUP BY Enrollment.OfferNo, CourseNo

 * sqlite:///dataset_university.db
Done.

[('imen001', 'offer01', 3),
 ('imen002', 'offer03', 5),
 ('imen002', 'offer04', 5),
 ('imen003', 'offer05', 3),
 ('imen003', 'offer06', 4)]

## SQL UNION Example

In [62]:
%%sql
SELECT FacSSN AS SSN, FacFirstName AS FirstName, FacLastName AS LastName
FROM Faculty
UNION
SELECT StdSSN AS SSN, StdFirstName AS FirstName, StdLastName AS LastName
FROM Student

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song'),
 ('fac002', 'Dong', 'Choi'),
 ('fac003', 'Min', 'Che'),
 ('fac004', 'Myung', 'Ko'),
 ('std001', 'Kang', 'Park'),
 ('std002', 'Duck', 'Lee'),
 ('std003', 'Jung', 'Lim'),
 ('std004', 'Han', 'Kim'),
 ('std005', 'Dae', 'Kim')]

## SQL INTERSECT Example

In [78]:
%%sql
SELECT FacSSN AS SSN, FacFirstName AS FirstName, FacLastName AS LastName
FROM Faculty 
INTERSECT
SELECT StdSSN AS SSN, StdFirstName AS FirstName, StdLastName AS LastName
FROM STUDENT

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song')]

In [80]:
%%sql
SELECT FacSSN AS SSN, FacFirstName AS FirstName, FacLastName AS LastName
FROM Faculty

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song'),
 ('fac002', 'Dong', 'Choi'),
 ('fac004', 'Myung', 'Ko'),
 ('fac003', 'Min', 'Che')]

In [79]:
%%sql
SELECT StdSSN AS SSN, StdFirstName AS FirstName, StdLastName AS LastName
FROM STUDENT

 * sqlite:///dataset_university.db
Done.

[('std001', 'Kang', 'Park'),
 ('std002', 'Duck', 'Lee'),
 ('std003', 'Jung', 'Lim'),
 ('std004', 'Han', 'Kim'),
 ('std005', 'Dae', 'Kim'),
 ('fac001', 'Min', 'Song')]

## SQL EXCEPT(MINUS) Example

In [70]:
%%sql
SELECT FacSSN AS SSN, FacFirstName AS FirstName, FacLastName AS LastName
FROM Faculty
EXCEPT
SELECT StdSSN AS SSN, StdFirstName AS FirstName, StdLastName AS LastName
FROM STUDENT

 * sqlite:///dataset_university.db
Done.

[('fac002', 'Dong', 'Choi'),
 ('fac003', 'Min', 'Che'),
 ('fac004', 'Myung', 'Ko')]

# SQL Manupulation

## INSERT Example

In [73]:
%%sql
INSERT INTO Student
(StdSSN, StdFirstName, StdLastName, StdCity, StdState, StdZip, StdClass, StdMajor, StdGPA) 
VALUES 
('999999999','JOE','STUDENT','SEATAC', 'WA','98042-1121','FR','IS', 0.0)

 * sqlite:///dataset_university.db
(sqlite3.OperationalError) table Student has no column named StdCity
[SQL: INSERT INTO Student
(StdSSN, StdFirstName, StdLastName, StdCity, StdState, StdZip, StdClass, StdMajor, StdGPA)
VALUES
('999999999','JOE','STUDENT','SEATAC', 'WA','98042-1121','FR','IS', 0.0)]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [82]:
%%sql

UPDATE Student
SET StdMajor = 'ACCT',
stdClass = 'SO'
WHERE StdFirstName = 'HOMER'
AND StdLastName = 'WELLS'

 * sqlite:///dataset_university.db
0 rows affected.

[]

In [83]:
%%sql
DELETE FROM Student
WHERE StdMajor = 'IS'
AND StdClass = 'SR'

 * sqlite:///dataset_university.db
2 rows affected.

[]

## Schema manipulation: Create and delete tables

In [85]:
%%sql
CREATE TABLE student(
StdSSN varchar primary key,
STDFirstName varchar NOT NULL,
StdLastName varchar NOT NULL,
StdClass varchar NOT NULL,
STDMajor varchar NOT NULL,
StdGPA float NOT NULL)

 * sqlite:///dataset_university.db
(sqlite3.OperationalError) table student already exists
[SQL: CREATE TABLE student(
StdSSN varchar primary key,
STDFirstName varchar NOT NULL,
StdLastName varchar NOT NULL,
StdClass varchar NOT NULL,
STDMajor varchar NOT NULL,
StdGPA float NOT NULL)]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [86]:
%%sql
CREATE TABLE offering( 
    OfferNo varchar primary key, OffTerm varchar NOT NULL, OffYear int NOT NULL, OffDays varcar NOT NULL, 
    CourseNo varchar NOT NULL, FacSSN varchar,
FOREIGN KEY (CourseNo) REFERENCES course (CourseNo), FOREIGN KEY (FacSSN) REFERENCES faculty (FacSSN) );

 * sqlite:///dataset_university.db
(sqlite3.OperationalError) table offering already exists
[SQL: CREATE TABLE offering(
    OfferNo varchar primary key, OffTerm varchar NOT NULL, OffYear int NOT NULL, OffDays varcar NOT NULL,
    CourseNo varchar NOT NULL, FacSSN varchar,
FOREIGN KEY (CourseNo) REFERENCES course (CourseNo), FOREIGN KEY (FacSSN) REFERENCES faculty (FacSSN) );]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [88]:
%%sql
DROP TABLE course;

 * sqlite:///dataset_university.db
Done.

[]

In [89]:
%%sql
DROP TABLE IF EXISTS course;

 * sqlite:///dataset_university.db
Done.

[]

# SQL_Python